Repository: renatomh/api-onlibrary
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, pt

source: You must provide the 'event' name.
de: Sie müssen den Namen „Ereignis“ angeben.
es: Debe proporcionar el nombre del 'evento'.
fr: Vous devez fournir le nom de "l'événement".
pt: Você deve fornecer o nome do evento ('event').

source: You must inform if message should be broadcast ('should_broadcast' flag as 'true' or 'false').
de: Sie müssen angeben, ob die Nachricht gesendet werden soll ('should_broadcast'-Flag als 'true' oder 'false').
es: Debe informar si el mensaje debe transmitirse (indicador 'should_broadcast' como 'verdadero' o 'falso').
fr: Vous devez indiquer si le message doit être diffusé (indicateur 'should_broadcast' comme 'true' ou 'false').
pt: Você deve informar se a mensagem deve ser transmitida a todos (flag 'should_broadcast' como 'true' ou 'false').

source: You must inform the session ID ('sid') when not broadcasting.
de: Sie müssen die Sitzungs-ID ('sid') angeben, wenn Sie nicht senden.
es: Debe informar el ID de la sesión ('sid') cuando no esté transmitiendo.
fr: Vous devez renseigner l'ID de session ('sid') lorsqu'il n'y a pas de diffusion.
pt: Você deve informar o ID da sessão ('sid') quando não estiver transmitindo a todos.

source: You must provide the message content as 'json' to be sent.
de: Sie müssen den Nachrichteninhalt als „json“ angeben, damit er gesendet werden kann.
es: Debe proporcionar el contenido del mensaje como 'json' para que se envíe.
fr: Vous devez fournir le contenu du message au format 'json' à envoyer.
pt: Você deve fornecer o conteúdo da mensagem (como 'json') a ser enviada.

source: Message sent successfully
de: Nachricht erfolgreich gesendet
es: Mensaje enviado con éxito
fr: message envoyé avec succès
pt: Mensagem enviada com sucesso

source: You must provide the notification 'title'.
de: Sie müssen den „Titel“ der Benachrichtigung angeben.
es: Debe proporcionar el 'título' de la notificación.
fr: Vous devez fournir le "titre" de la notification.
pt: Você deve fornecer o título de notificação ('title').

source: You must provide the notification 'body'.
de: Sie müssen den Benachrichtigungstext angeben.
es: Debe proporcionar el 'cuerpo' de la notificación.
fr: Vous devez fournir le « corps » de la notification.
pt: Você deve fornecer o corpo de notificação ('body').

source: You must inform if message should be multicast ('should_multicast' flag as 'true' or 'false').
de: Sie müssen angeben, ob die Nachricht Multicast sein soll ('should_multicast'-Flag als 'true' oder 'false').
es: Debe informar si el mensaje debe ser de multidifusión (indicador 'should_multicast' como 'verdadero' o 'falso').
fr: Vous devez indiquer si le message doit être multicast (indicateur 'should_multicast' comme 'true' ou 'false').
pt: Você deve informar se a mensagem deve ser enviada a mais de um usuário (flag 'should_multicast' como 'true' ou 'false').

source: You must inform one token ('token') when not multicasting.
de: Sie müssen einen Token ('token') informieren, wenn Sie kein Multicasting durchführen.
es: Debe informar un token ('token') cuando no esté realizando multidifusión.
fr: Vous devez renseigner un jeton ('token') lorsqu'il n'y a pas de multidiffusion.
pt: Você deve informar um token ('token') quando não estiver enviando a mais de um usuário.

source: You must inform a list of tokens ('tokens') when multicasting.
de: Sie müssen beim Multicasting eine Liste von Tokens ('tokens') mitteilen.
es: Debe informar una lista de tokens ('tokens') cuando se realiza la multidifusión.
fr: Vous devez renseigner une liste de tokens ('tokens') lors de la multidiffusion.
pt: Você deve informar uma lista de tokens ('tokens') quando estiver enviando a mais de um usuário.

source: Resource not found.
de: Ressource nicht gefunden.
es: Recurso no encontrado.
fr: Ressource introuvable.
pt: Recurso não encontrado.

source: Content too large
de: Inhalt zu groß
es: Contenido demasiado grande
fr: Contenu trop volumineux
pt: Conteúdo muito longo

source: Ratelimit exceeded
de: Frequenzgrenze überschritten
es: Excede el límite de velocidad
fr: Limite de débit dépassée
pt: Taxa limite excedida

source: Authentication failed. Please login to access the resource.
de: Authentifizierung fehlgeschlagen. Bitte melden Sie sich an, um auf die Ressource zuzugreifen.
es: La autenticación falló. Inicie sesión para acceder al recurso.
fr: Authentification échouée. Veuillez vous connecter pour accéder à la ressource.
pt: Falha de autenticação. Por favor, faça o login para acessar o recurso.

source: Authorization failed. Please use an account with the correct access rights.
de: Autorisation fehlgeschlagen. Bitte verwenden Sie ein Konto mit den richtigen Zugriffsrechten.
es: Autorización fallida. Utilice una cuenta con los derechos de acceso correctos.
fr: L'autorisation à échouée. Veuillez utiliser un compte avec les droits d'accès corrects.
pt: Falha de autorização. Por favor, use uma conta com os privilégios de acesso corretos.

source: Not a valid datetime value
de: Kein gültiger datetime-Wert
es: No es un valor de fecha y hora válido
fr: Pas une valeur datetime valide
pt: Valor de data e hora inválido

source: Not a valid date value
de: Kein gültiger Datumswert
es: No es un valor de fecha válido
fr: Pas une valeur de date valide
pt: Valor de data inválido

source: Not a valid time value
de: Kein gültiger Zeitwert
es: No es un valor de tiempo válido
fr: Pas une valeur de temps valide
pt: Valor de hora inválido

source: This name is already in use.
de: Dieser Name wird bereits verwendet.
es: Este nombre ya esta en uso.
fr: Ce nom est déjà utilisé.
pt: O nome já está em uso.

source: No country found
de: Kein Land gefunden
es: Ningún país encontrado
fr: Aucun pays trouvé
pt: Nenhum país encontrado

source: No item found
de: Kein Artikel gefunden
es: No se encontró ningún artículo
fr: Aucun élément trouvé
pt: Nenhum item encontrado

source: File not sent
de: Datei nicht gesendet
es: Archivo no enviado
fr: Fichier non envoyé
pt: Arquivo não enviado

source: File extension not allowed
de: Dateierweiterung nicht zulässig
es: Extensión de archivo no permitida
fr: Extension de fichier non autorisée
pt: Extensão de arquivo não permitido

source: There are other items associated with this item
de: Diesem Artikel sind weitere Artikel zugeordnet
es: Hay otros artículos asociados con este artículo.
fr: Il y a d'autres articles associés à cet article
pt: Existem outros itens associados a este item

source: No author found
de: Kein Autor gefunden
es: Ningún autor encontrado
fr: Aucun auteur trouvé

source: No publisher found
de: Kein Verlag gefunden
es: No se encontró ningún editor
fr: Aucun éditeur trouvé

source: This genre is already in use for this book.
es: Este género ya está en uso para este libro.

source: No book found
es: Ningún libro encontrado

source: No genre found
es: No se encontró ningún género

source: This code is already in use.
de: Dieser Code wird bereits verwendet.
es: Este código ya está en uso.
fr: Ce code est déjà utilisé.
pt: O código já está em uso.

source: Item library not allowed for user
de: Elementbibliothek für Benutzer nicht zulässig
es: Biblioteca de elementos no permitida para el usuario
fr: Bibliothèque d'éléments non autorisée pour l'utilisateur
pt: Biblioteca de itens não permitida para o usuário

source: No document category found
de: Keine Dokumentkategorie gefunden
es: No se encontró ninguna categoría de documento
fr: Aucune catégorie de document trouvée
pt: Nenhuma categoria de documento encontrada

source: Alert email must be provided, since user has no email associated
de: Es muss eine Benachrichtigungs-E-Mail bereitgestellt werden, da dem Benutzer keine E-Mail zugeordnet ist
es: Se debe proporcionar un correo electrónico de alerta, ya que el usuario no tiene un correo electrónico asociado
fr: L'e-mail d'alerte doit être fourni, car l'utilisateur n'a pas d'e-mail associé
pt: O e-mail para alerta deve ser fornecido, dado que o usuário não possui um e-mail associado

source: Days to alert must be provided
de: Alarmtage müssen angegeben werden
es: Se deben proporcionar días para alertar
fr: Les jours d'alerte doivent être fournis
pt: A quantidade de dias para o envio do alerta deve ser fornecida

source: Document category does not belong to defined library
de: Dokumentkategorie gehört nicht zur definierten Bibliothek
es: La categoría del documento no pertenece a la biblioteca definida
fr: La catégorie de document n'appartient pas à la bibliothèque définie
pt: A categoria do documento não pertence à biblioteca definida

source: This document is already associated to the model
de: Dieses Dokument ist bereits mit dem Modell verknüpft
es: Este documento ya está asociado al modelo
fr: Ce document est déjà associé au modèle
pt: O documento já está associado ao modelo

source: No document found
de: Kein Dokument gefunden
es: Documento no encontrada
fr: Aucun document trouvé
pt: Nenhum documento encontrado

source: No model found
de: Kein Modell gefunden
es: Modelo no encontrado
fr: Aucun modèle trouvé
pt: Nenhum modelo encontrado

source: Model not applicable
de: Modell nicht zutreffend
es: Modelo no aplicable
fr: Modèle non applicable
pt: Modelo não aplicável

source: Only the document owner can share the file
de: Nur der Eigentümer des Dokuments kann die Datei freigeben
es: Solo el propietario del documento puede compartir el archivo.
fr: Seul le propriétaire du document peut partager le fichier
pt: Somente o proprietário do documento pode compartilhar o arquivo

source: No user found
de: Kein Benutzer gefunden
es: Usuario no encontrado.
fr: Aucun utilisateur trouvé
pt: Nenhum usuário encontrado

source: You already own this file
de: Sie besitzen diese Datei bereits
es: Ya eres dueño de este archivo
fr: Vous possédez déjà ce fichier
pt: Você já é o proprietário do arquivo

source: This document is already shared with the user
de: Dieses Dokument wurde bereits für den Benutzer freigegeben
es: Este documento ya está compartido con el usuario.
fr: Ce document est déjà partagé avec l'utilisateur
pt: O documento já está compartilhado com o usuário

source: Only the document owner can stop sharing the file
de: Nur der Eigentümer des Dokuments kann die Freigabe der Datei beenden
es: Solo el propietario del documento puede dejar de compartir el archivo.
fr: Seul le propriétaire du document peut arrêter de partager le fichier
pt: Somente o proprietário do documento pode interromper o compartilhamento

source: Users will be notified
de: Benutzer werden benachrichtigt
es: Los usuarios serán notificados
fr: Les utilisateurs seront avertis
pt: Os usuários serão notificados

source: Document Expiration
de: Ablauf des Dokuments
es: Caducidad del documento
fr: Expiration des documents
pt: Vencimento do Documento

source: Your document is about to expire
de: Ihr Dokument läuft bald ab
es: Su documento está a punto de caducar
fr: Votre document est sur le point d'expirer
pt: Seu documento está prestes a vencer

source: Expires At
de: Läuft ab um
es: Caduca a las
fr: Expire à
pt: Vence Em

source: days
de: Tage
es: dias
fr: jours
pt: dias

source: Description
de: Beschreibung
es: Descripción
pt: Descrição

source: File
de: Datei
es: Archivo
fr: Déposer
pt: Arquivo

source: Only the notified user can set this notification as read
de: Nur der benachrichtigte Benutzer kann diese Benachrichtigung als gelesen setzen
es: Solo el usuario notificado puede configurar esta notificación como leída
fr: Seul l'utilisateur notifié peut définir cette notification comme lue
pt: Somente o usuário notificado pode definir esta notificação como lida

source: The read date cannot be in the future.
de: Das Lesedatum darf nicht in der Zukunft liegen.
es: La fecha de lectura no puede ser en el futuro.
fr: La date de lecture ne peut pas être dans le futur.
pt: A data de leitura não pode ser no futuro.

source: Only the notified user can delete this notification
de: Nur der benachrichtigte Benutzer kann diese Benachrichtigung löschen
es: Solo el usuario notificado puede eliminar esta notificación.
fr: Seul l'utilisateur notifié peut supprimer cette notification
pt: Somente o usuário notificado pode excluir esta notificação

source: No city found
de: Keine Stadt gefunden
es: No se encontró ninguna ciudad
fr: Aucune ville trouvée
pt: Nenhuma cidade encontrada

source: Account not active. Please contact the system admin.
de: Konto nicht aktiv. Bitte wenden Sie sich an den Systemadministrator.
es: Cuenta no activa. Póngase en contacto con el administrador del sistema.
fr: Compte non actif. Veuillez contacter l'administrateur système.
pt: Conta não ativa. Entre em contato com o administrador do sistema.

source: Not provided
de: Nicht vorgesehen
es: No provisto
fr: Non fourni
pt: Não fornecido

source: User/password combination doesn't match.
de: Benutzer/Passwort-Kombination stimmt nicht überein.
es: La combinación de usuario/contraseña no coincide.
fr: La combinaison utilisateur/mot de passe ne correspond pas.
pt: A combinação de usuário/senha não corresponde.

source: This email address is already registered.
de: Diese Email-Adresse ist bereits registriert.
es: Esta dirección de correo electrónico ya está registrada.
fr: Cette adresse email est déjà enregistrée.
pt: O endereço de e-mail já está em uso.

source: This email domain is not allowed.
de: Diese E-Mail-Domäne ist nicht zulässig.
es: Este dominio de correo electrónico no está permitido.
fr: Ce domaine de messagerie n'est pas autorisé.
pt: O domínio do e-mail não é permitido.

source: Welcome to OnLibrary!
de: Willkommen bei OnLibrary!
es: ¡Bienvenido a OnLibrary!
fr: Bienvenue sur OnLibrary !
pt: Bem-vindo à OnLibrary!

source: This email address is not registered.
de: Diese Email-Adresse ist nicht registriert.
es: Esta dirección de email no está registrada.
fr: Cette adresse e-mail n'est pas enregistrée.
pt: O endereço de e-mail não está cadastrado.

source: OnLibrary Password Reset
de: Zurücksetzen des OnLibrary-Kennworts
es: Restablecimiento de contraseña de OnLibrary
fr: Réinitialisation du mot de passe OnLibrary
pt: Redefinição de senha OnLibrary

source: No role found
de: Keine Rolle gefunden
es: No se encontró ningún rol
fr: Aucun rôle trouvé
pt: Nenhum perfil encontrado

source: This username is already in use.
de: Dieser Benutzername wird bereits benutzt.
es: Este nombre de usuario ya está en uso.
fr: Ce nom d'utilisateur est déjà utilisé.
pt: O nome de usuário já está em uso.

source: Passwords don't match.
de: Passwörter stimmen nicht überein.
es: Las contraseñas no coinciden.
fr: Les mots de passe ne correspondent pas.
pt: As senhas não coincidem

source: Please inform your current password.
de: Bitte teilen Sie Ihr aktuelles Passwort mit.
es: Por favor, informe su contraseña actual.
fr: Veuillez renseigner votre mot de passe actuel.
pt: Por favor, informe sua senha atual.

source: The provided current password is wrong.
de: Das angegebene aktuelle Passwort ist falsch.
es: La contraseña actual proporcionada es incorrecta.
fr: Le mot de passe actuel fourni est erroné.
pt: A senha atual fornecida está errada.

source: The route on the selected method is already in use for this role.
de: Die Route auf der ausgewählten Methode wird bereits für diese Rolle verwendet.
es: La ruta en el método seleccionado ya está en uso para este rol.
fr: La route sur la méthode sélectionnée est déjà utilisée pour ce rôle.
pt: A rota no método selecionado já está em uso para este grupo de acesso.

source: The action is already in use for this role.
de: Die Aktion wird für diese Rolle bereits verwendet.
es: La acción ya está en uso para este rol.
fr: L'action est déjà utilisée pour ce rôle.
pt: A ação já está em uso para este grupo de acesso.

source: There is a document which will expire soon
de: Es gibt ein Dokument, das bald abläuft
es: Hay un documento que caducará pronto.
fr: Il y a un document qui va bientôt expirer
pt: Há um documento que vencerá em breve

source: Days to expire
de: Tage verfallen
es: Días para expirar
fr: Jours à expirer
pt: Dias para o vencimento

source: Below you can find the details for the document.
de: Unten finden Sie die Details für das Dokument.
es: A continuación puede encontrar los detalles del documento.
fr: Vous trouverez ci-dessous les détails du document.
pt: Abaixo você encontra os detalhes do documento.

source: Code
es: Código
pt: Código

source: Observations
de: Beobachtungen
es: Observaciones
pt: Observações

source: Uploaded By
de: Hochgeladen von
es: Subido por
fr: Telechargé par
pt: Enviado Por

source: The document file can be accessed in the link below.
de: Die Dokumentdatei kann unter folgendem Link aufgerufen werden.
es: Se puede acceder al archivo del documento en el siguiente enlace.
fr: Le fichier du document est accessible dans le lien ci-dessous.
pt: O arquivo do documento pode ser acessado no link abaixo.

source: View Document File
de: Dokumentdatei anzeigen
es: Ver archivo de documento
fr: Afficher le fichier du document
pt: Ver Arquivo de Documento

source: You've received this message because your e-mail address was set to be notified upon document expiration. If you believe this is a mistake, please ignore this message.
de: Sie haben diese Nachricht erhalten, weil Ihre E-Mail-Adresse so eingestellt wurde, dass sie bei Ablauf des Dokuments benachrichtigt wird. Wenn Sie glauben, dass dies ein Fehler ist, ignorieren Sie diese Nachricht bitte.
es: Ha recibido este mensaje porque su dirección de correo electrónico se configuró para recibir una notificación al vencimiento del documento. Si cree que se trata de un error, ignore este mensaje.
fr: Vous avez reçu ce message car votre adresse e-mail a été configurée pour être notifiée à l'expiration du document. Si vous pensez qu'il s'agit d'une erreur, veuillez ignorer ce message.
pt: Você recebeu esta mensagem porque seu endereço de e-mail foi configurado para ser notificado sobre o vencimento do documento. Se você acredita que isso é um erro, ignore esta mensagem.

source: Forgot your password
de: Haben Sie Ihr Passwort vergessen
es: Olvidaste tu contraseña
fr: Mot de passe oublié
pt: Esqueceu sua senha

source: Hello
de: Hallo
es: Hola
fr: Bonjour
pt: Olá

source: it looks like you forgot your password at
de: es sieht so aus, als hätten Sie Ihr Passwort unter vergessen
es: parece que olvidaste tu contraseña en
fr: il semble que vous ayez oublié votre mot de passe à
pt: parece que você esqueceu sua senha em

source: Click the following button to change your account password.
de: Klicken Sie auf die folgende Schaltfläche, um Ihr Kontopasswort zu ändern.
es: Haga clic en el siguiente botón para cambiar la contraseña de su cuenta.
fr: Cliquez sur le bouton suivant pour modifier le mot de passe de votre compte.
pt: Clique no botão abaixo para redefinir sua senha.

source: Change Password
de: Kennwort ändern
es: Cambia la contraseña
fr: Changer le mot de passe
pt: Redefinir senha

source: You received this email because you've requested a password reset at OnLibrary. If you believe this is a mistake, please ignore this message -- the password hasn't been changed yet.
de: Sie haben diese E-Mail erhalten, weil Sie bei OnLibrary eine Kennwortzurücksetzung angefordert haben. Wenn Sie glauben, dass dies ein Fehler ist, ignorieren Sie bitte diese Nachricht – das Passwort wurde noch nicht geändert.
es: Recibió este correo electrónico porque solicitó un restablecimiento de contraseña en OnLibrary. Si cree que se trata de un error, ignore este mensaje: la contraseña aún no se ha cambiado.
fr: Vous avez reçu cet e-mail car vous avez demandé une réinitialisation de mot de passe à OnLibrary. Si vous pensez qu'il s'agit d'une erreur, veuillez ignorer ce message -- le mot de passe n'a pas encore été modifié.
pt: Você recebeu este e-mail porque solicitou uma redefinição de senha na OnLibrary. Se você acredita que isso é um engano, ignore esta mensagem -- a senha ainda não foi alterada.

source: You're almost there
de: Du bist fast da
es: Ya casi estás ahí
fr: Tu y es presque
pt: Você está quase lá

source: thank you for signing up to the
de: vielen Dank für Ihre Anmeldung
es: gracias por suscribirte a la
fr: merci de vous être inscrit au
pt: obrigado por se registrar em

source: Click the following button to verify your email address.
de: Klicken Sie auf die folgende Schaltfläche, um Ihre E-Mail-Adresse zu bestätigen.
es: Haga clic en el siguiente botón para verificar su dirección de correo electrónico.
fr: Cliquez sur le bouton suivant pour vérifier votre adresse e-mail.
pt: Clique no botão abaixo para verificar seu endereço de e-mail.

source: Verify
de: Verifizieren
es: Verificar
fr: Vérifier
pt: Verificar

source: You received this email because you've registered a new account at OnLibrary. If you believe this is a mistake, please ignore this message -- the account hasn't been activated yet.
de: Sie haben diese E-Mail erhalten, weil Sie ein neues Konto bei OnLibrary registriert haben. Wenn Sie glauben, dass dies ein Fehler ist, ignorieren Sie bitte diese Nachricht – das Konto wurde noch nicht aktiviert.
es: Recibiste este correo electrónico porque registraste una nueva cuenta en OnLibrary. Si cree que se trata de un error, ignore este mensaje: la cuenta aún no se ha activado.
fr: Vous avez reçu cet e-mail car vous avez enregistré un nouveau compte sur OnLibrary. Si vous pensez qu'il s'agit d'une erreur, veuillez ignorer ce message : le compte n'a pas encore été activé.
pt: Você recebeu este e-mail porque registrou uma nova conta na OnLibrary. Se você acredita que isso é um engano, ignore esta mensagem -- a conta ainda não foi ativada.

source: QR Code
es: Código QR
pt: Código QR
